### Snapshot Service Plan: success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.external.sources_tar: Reading...
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=c77d1ebbb6f78dfc539ffb4421bfd67e307990e8]
module.daily_snapshot.data.external.sources_tar: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=5a2cc6d28c76636985dc4fb4c12ddf836e6709a2]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...
module.daily_snapshot.digitalocean_volume.forest_storage: Refreshing state... [id=485e2871-ed79-11ed-b28e-0a58ac14d286]
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/12886492327922169494]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=355442084]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=d1126156-0675-41ec-a6db-cd30d4768db6]
module.daily_snapshot.digitalocean_volume_attachment.attach_forest_storage: Refreshing state... [id=355442084-485e2871-ed79-11ed-b28e-0a58ac14d286-20230515112229471700000001]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-05-15T11:21:33Z" -> (known after apply)
      ~ disk                 = 300 -> (known after apply)
      ~ id                   = "355442084" -> (known after apply)
      ~ ipv4_address         = "209.38.236.160" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.3" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-snapshot"
      ~ price_hourly         = 0.19494 -> (known after apply)
      ~ price_monthly        = 131 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:355442084" -> (known after apply)
      ~ user_data            = "b0a6c1375893e34fdd4e34ceabc79ef1999f8f39" -> "ec243f34ad0813470c00c96433fa49868cd77dae" # forces replacement
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [
          - "485e2871-ed79-11ed-b28e-0a58ac14d286",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 355442084,
        ] -> (known after apply)
        id              = "d1126156-0675-41ec-a6db-cd30d4768db6"
        name            = "forest-snapshot"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:355442084",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.daily_snapshot.digitalocean_volume_attachment.attach_forest_storage must be replaced
-/+ resource "digitalocean_volume_attachment" "attach_forest_storage" {
      ~ droplet_id = 355442084 # forces replacement -> (known after apply) # forces replacement
      ~ id         = "355442084-485e2871-ed79-11ed-b28e-0a58ac14d286-20230515112229471700000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "209.38.236.160",
        ],
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>